"""
Для быстрой замены
и генерации одинаковых объектов
"""

s = """
  Component
. ---------
. =====================================================
. || Route | Command || Parameters || Areas | Shared ||
. =====================================================
  ||  YES  |  COM2   ||  KC_2N2P   ||   2   |   NO   ||
. =====================================================

. ========================
. || Pretest indicators ||
. ========================
  ||                    ||
. ========================

  Main objects

. =======================================================================
. ||  Object  | Manouevre | Seq. | Approved || Object | Seq. | Pretest ||
. =======================================================================
  || LN_N2P_C | M_BLK = 1 |  1   |          ||        |      |         ||
  || LN_N2P_C | M_CC = 2  |  1   |          ||        |      |         ||
  || LN_N2P_N | M_BLK = 1 |  1   |          ||        |      |         ||
  || LN_N2P_N | M_CC = 2  |  1   |          ||        |      |         ||
. =======================================================================

  Component
. ---------
. =====================================================
. || Route | Command || Parameters || Areas | Shared ||
. =====================================================
  ||  YES  |  COM3   ||  KC_2N2P   ||   2   |   NO   ||
. =====================================================

. ========================
. || Pretest indicators ||
. ========================
  ||                    ||
. ========================

  Main objects

. =======================================================================
. ||  Object  | Manouevre | Seq. | Approved || Object | Seq. | Pretest ||
. =======================================================================
  || LN_N2P_C | M_BLK = 2 |  1   |          ||        |      |         ||
  || LN_N2P_C | M_CC = 2  |  1   |          ||        |      |         ||
  || LN_N2P_N | M_BLK = 2 |  1   |          ||        |      |         ||
  || LN_N2P_N | M_CC = 2  |  1   |          ||        |      |         ||
. =======================================================================

"""

list_replace = [f'N{str(i)}P' for i in range(2, 29, 2)]
# print(list(list_replace))

result = (s.strip().replace('N2P', name) for name in list_replace)
# for name in list_replace:
#     result.append(s.strip().replace('N2P', name))

result = '\n\n  '.join(result)

print(result)

with open('out_replace.txt', 'w', encoding='utf8') as f:
    f.write(f'  {result}')